app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 2]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 2]]
---
<h4>Če imate, kakšno vprašanje, pohvalo, zapišite to v komentar.</h4>
<h2>Število komentarjev: <%= @post.comments.count %> </h2>