app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("name", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "asd"], ["body", "asd"], ["post_id", 2], ["created_at", "2020-05-18 17:28:13.368577"], ["updated_at", "2020-05-18 17:28:13.368577"]]
UPDATE "comments" SET "name" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["name", "Jan"], ["updated_at", "2020-05-18 18:06:30.247423"], ["id", 14]]
---
    def create
        @post = Post.find(params[:post_id])
        @comment = @post.comments.create(params[:comment].permit(:name, :body))
        @comment.name = current_user.username
        @comment.save